       IDENTIFICATION DIVISION.
       PROGRAM-ID. numbers.
       AUTHOR. John Braddock.
      
       ENVIRONMENT DIVISION.
      
       DATA DIVISION.
       WORKING-STORAGE SECTION.
          01  exit_sts             PIC 99.
       PROCEDURE DIVISION.
         main.
            DISPLAY "Running Numbers vers 1.01"
            STOP RUN
            .
